src/InformationRegisters/ксСеансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксСеансы</Name>
			<Comment>DEV-12001</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>sessionId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>infobase</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>process</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>userName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>host</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>appId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>locale</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>startedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>lastActiveAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>hibernate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>passiveSessionHibernateTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>hibernateSessionTerminateTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>blockedByDbms</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>blockedByLs</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>bytesAll</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>bytesLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>callsAll</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>callsLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dbmsBytesAll</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dbmsBytesLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dbProcInfo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dbProcTook</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dbProcTookAt</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationAll</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationAllDbms</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationCurrent</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationCurrentDbms</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationLast5minDbms</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>memoryCurrent</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>memoryLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>memoryTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>readCurrent</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>readLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>readTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>writeCurrent</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>writeLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>writeTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationCurrentService</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationLast5minService</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>durationAllService</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currentServiceName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cpuTimeCurrent</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cpuTimeLast5min</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cpuTimeTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dataSeparation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>clientIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>session</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ксИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксИнформационныеБазы</Name>
			<Comment>DEV-12001</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>descr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>infobase</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/МодульRAC/Ext/Module.bsl
Функция ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи = "cp866", КодировкаЧтения = "cp866") Экспорт
	
	//Ковычка = Символ(34); 
	//ПарамOutLog1c = ПолучитьИмяВременногоФайла("txt"); 
	//
	//МассивКомманд = Новый Массив;
	//МассивКомманд.Добавить(ТекущаяКоманда);
	//МассивКомманд.Добавить(" > ");
	//МассивКомманд.Добавить(ПарамOutLog1c);
	//
	//стрКоманда = СтрСоединить(МассивКомманд," ");   
	//
	//ЗапуститьПриложение(стрКоманда,,Истина);   
	//
	////чтение логов
	//РезультатКоманды = "";
	//ТекстФайл = новый Файл(ПарамOutLog1c);
	//Если ТекстФайл.Существует() Тогда
	//	Текст = Новый ТекстовыйДокумент;	
	//	Текст.Прочитать(ПарамOutLog1c);	
	//	РезультатКоманды = Текст.ПолучитьТекст();
	//КонецЕсли;
	////Сообщить("мТекстФайла: "+мТекстФайла);   	
	//УдалитьФайлы(ПарамOutLog1c);
	
	
	
	/////////////////////////
	КодВозврата = Неопределено;
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	ПолноеИмяИмяБатФайла = ПолучитьИмяВременногоФайла("bat");
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
	//ИмяБатФайла = "1CInfo.bat";
	//ИмяВременногоФайла = КаталогВременныхФайлов + "InfoLic.txt";
	//ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла;
	ИмяБатФайла = СтрЗаменить(ПолноеИмяИмяБатФайла, КаталогВременныхФайлов, "");
	
	БатФайл = Новый ТекстовыйДокумент;
	БатФайл.ДобавитьСтроку(ТекущаяКоманда + " > " + ИмяВременногоФайла);
	БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
	
	ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);
	
	ФайлЛицензий = Новый ТекстовыйДокумент;
	ФайлЛицензий.Прочитать(ИмяВременногоФайла, КодировкаЧтения);	
	
	РезультатКоманды = ФайлЛицензий.ПолучитьТекст();
	
	ФайлЛицензий = Неопределено;
	
	УдалитьФайлы(ПолноеИмяИмяБатФайла);
	УдалитьФайлы(ИмяВременногоФайла);



	Возврат РезультатКоманды;
	
КонецФункции

Функция ПолучитьСтрокуПлатформыRAC()
	
	Возврат """" + КаталогПрограммы() + "rac.exe""";
	
КонецФункции


Функция ПолучитьИдентификаторКластера(СтрокаПлатформа,Сервер,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	СтрокаИдентификаторКластера = "";     
		
	мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
	СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
	СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
	
	ТекущаяКоманда = СтрокаПлатформа + СерверПорт +" cluster list";
	
	
	РезультатКоманды = ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи, КодировкаЧтения);
	
	МассивИнформации = СтрРазделить(РезультатКоманды, Символы.ПС, Ложь);
	
	Для Каждого Элемент Из МассивИнформации Цикл
		
		Если СтрНайти(Элемент, "cluster") > 0 Тогда
			
			МассивИД = СтрРазделить(Элемент, ":", Ложь);
			
			Если МассивИД.Количество() > 1 Тогда
				
				СтрокаИдентификаторКластера = СокрЛП(МассивИД[1]);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СтрокаИдентификаторКластера;
	
КонецФункции

Функция ПолучитьТаблицуЛицензийНаСервере(СтрокаПлатформа,Сервер,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	    	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
		
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " session --cluster=" + ИдентификаторКластера + " list --licenses";
	
		СписокЛицензий = ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи, КодировкаЧтения);
		
		МассивИнформации = СтрРазделить(СписокЛицензий, Символы.ПС);
		
		ТаблицаЛицензий = новый ТаблицаЗначений;
		мКолонкиТЗ = "Сессия,Пользователь,Сервер,Кластер,Приложение,ЭтоКонфигуратор,ИмяФайла,Комплект,ИспользуетсяНаСервере,ТипЛицензии,МаксимумПользователей,PID,Описание,ПолноеОписание";
		Для Каждого ТекЭлемента из СтрРазделить(мКолонкиТЗ,",") Цикл
			ТаблицаЛицензий.Колонки.Добавить(ТекЭлемента);
		КонецЦикла;		
		
		Для Каждого ЭлементТекст Из МассивИнформации Цикл
			
			МассивКолонки = СтрРазделить(ЭлементТекст, ":", Истина);
			
			Если МассивКолонки.Количество() > 1 Тогда
				
				Если СтрНайти(МассивКолонки[0], "session") > 0 Тогда 
					
					НоваяСтрока = ТаблицаЛицензий.Добавить();
					
					НоваяСтрока.Сессия = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					НоваяСтрока.Кластер = СтрШаблон("%1:%2",Сервер,НомерПорта);
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "user-name") > 0 Тогда 
					
					НоваяСтрока.Пользователь = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "host") > 0 Тогда 
					
					НоваяСтрока.Сервер = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "app-id") > 0 Тогда 
					
					НоваяСтрока.Приложение = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
					Если НоваяСтрока.Приложение = "Designer" Тогда
						
						НоваяСтрока.Приложение = "Конфигуратор";
						
						НоваяСтрока.ЭтоКонфигуратор = Истина;// DEV-8653 ЗыковГС 2022.10.28
						
					ИначеЕсли НоваяСтрока.Приложение = "1CV8" Тогда
						
						НоваяСтрока.Приложение = "Толстый клиент";
						
					ИначеЕсли НоваяСтрока.Приложение = "1CV8C" Тогда
						
						НоваяСтрока.Приложение = "Тонкий клиент";
						
					ИначеЕсли НоваяСтрока.Приложение = "WebClient" Тогда
						
						НоваяСтрока.Приложение = "Веб-клиент";
						
					КонецЕсли;
					  
				ИначеЕсли СтрНайти(МассивКолонки[0], "full-name") > 0 Тогда 
					
					НоваяСтрока.ИмяФайла = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "series") > 0 Тогда 
					
					НоваяСтрока.Комплект = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "issued-by-server") > 0 Тогда 
					
					НоваяСтрока.ИспользуетсяНаСервере = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "license-type") > 0 Тогда 
					
					НоваяСтрока.ТипЛицензии = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
					Если НоваяСтрока.ТипЛицензии = "soft" Тогда
						
						НоваяСтрока.ТипЛицензии = "Программная";
						
					КонецЕсли;
										
				ИначеЕсли СтрНайти(МассивКолонки[0], "max-users-all") > 0 Тогда 
					
					НоваяСтрока.МаксимумПользователей = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				//ИначеЕсли СтрНайти(МассивКолонки[0], "rmngr-address") > 0 Тогда 
					
					//НоваяСтрока.Кластер = Сервер;

				ИначеЕсли СтрНайти(МассивКолонки[0], "rmngr-pid") > 0 Тогда 
					
					НоваяСтрока.PID = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "short-presentation") > 0 Тогда 
					
					НоваяСтрока.Описание = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "full-presentation") > 0 Тогда 
					
					НоваяСтрока.ПолноеОписание = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				КонецЕсли;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;  
	
	Возврат ТаблицаЛицензий;

КонецФункции 

//DEV-12001 baklanov 02.12.2024
Функция ПолучитьТаблицуСеансовНаСервере(СтрокаПлатформа,Сервер,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
		
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " session list --cluster=" + ИдентификаторКластера;
	
		СписокСеансов = ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи, КодировкаЧтения);
		
		МассивИнформации = СтрРазделить(СписокСеансов, Символы.ПС);
		
		ТаблицаСеансов = новый ТаблицаЗначений;
		//мКолонкиТЗ = "Сессия,Пользователь,Сервер,Кластер,Приложение,ЭтоКонфигуратор,ИмяФайла,Комплект,ИспользуетсяНаСервере,ТипЛицензии,МаксимумПользователей,PID,Описание,ПолноеОписание";
		мКолонкиТЗ = "session,cluster,sessionId,infobase,connection,process,userName,host,appId,locale,startedAt,lastActiveAt,hibernate,passiveSessionHibernateTime,hibernateSessionTerminateTime,blockedByDbms,blockedByLs,bytesAll,bytesLast5min,callsAll,callsLast5min,dbmsBytesAll,dbmsBytesLast5min,dbProcInfo,dbProcTook,dbProcTookAt,durationAll,durationAllDbms,durationCurrent,durationCurrentDbms,durationLast5min,durationLast5minDbms,memoryCurrent,memoryLast5min,memoryTotal,readCurrent,readLast5min,readTotal,writeCurrent,writeLast5min,writeTotal,durationCurrentService,durationLast5minService,durationAllService,currentServiceName,cpuTimeCurrent,cpuTimeLast5min,cpuTimeTotal,dataSeparation,clientIP";
		Для Каждого ТекЭлемента из СтрРазделить(мКолонкиТЗ,",") Цикл
			ТаблицаСеансов.Колонки.Добавить(ТекЭлемента);
		КонецЦикла;
		Для Каждого ЭлементТекст Из МассивИнформации Цикл
			МассивКолонки = СтрРазделить(ЭлементТекст, ":", Истина);
			Если МассивКолонки.Количество() > 1 Тогда
				Если СокрЛП(МассивКолонки[0]) ="session" Тогда 
					НоваяСтрока = ТаблицаСеансов.Добавить();				
					НоваяСтрока.session = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					НоваяСтрока.cluster = СтрШаблон("%1:%2",Сервер,НомерПорта);
				Иначе 
					ИмяКолонки =  СокрЛП(СтрЗаменить(МассивКолонки[0], "-", ""));
					НоваяСтрока[ИмяКолонки] = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;  
	
	Возврат ТаблицаСеансов;

КонецФункции 

//DEV-12001 baklanov 03.12.2024
Процедура ЗаполнитьТаблицуСеансовНаСервере(СтрокаПлатформа,Сервер,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	    	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
		
		//ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " session list --cluster=" + ИдентификаторКластера; 
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " session list --cluster=" + ИдентификаторКластера; 
		мКолонкиТЗ = "session,sessionId,infobase,connection,process,userName,host,appId,locale,startedAt,lastActiveAt,hibernate,passiveSessionHibernateTime,hibernateSessionTerminateTime,blockedByDbms,blockedByLs,bytesAll,bytesLast5min,callsAll,callsLast5min,dbmsBytesAll,dbmsBytesLast5min,dbProcInfo,dbProcTook,dbProcTookAt,durationAll,durationAllDbms,durationCurrent,durationCurrentDbms,durationLast5min,durationLast5minDbms,memoryCurrent,memoryLast5min,memoryTotal,readCurrent,readLast5min,readTotal,writeCurrent,writeLast5min,writeTotal,durationCurrentService,durationLast5minService,durationAllService,currentServiceName,cpuTimeCurrent,cpuTimeLast5min,cpuTimeTotal,dataSeparation,clientIP";
		ПериодЗаписи = ТекущаяДата(); 
		ТаблицаСеансов = ПолучитьТаблицуНаСервере(ТекущаяКоманда,мКолонкиТЗ,КодировкаЗаписи,КодировкаЧтения);
		Кластер = СтрШаблон("%1:%2",Сервер,мНомерПорта);   
		//Для Каждого Строка Из ТаблицаСеансов Цикл
		//	ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " session --cluster=" + ИдентификаторКластера + " info --session=" + Строка.session;
		//	мКолонкиТЗ = "session,sessionId,infobase,connection";
		//	ТаблицаИнформации = ПолучитьТаблицуНаСервере(ТекущаяКоманда,мКолонкиТЗ,КодировкаЗаписи,КодировкаЧтения);

		//КонецЦикла;
		РегистрыСведений.ксСеансы.ЗаписатьСеансы(ТаблицаСеансов, Кластер, ПериодЗаписи);	
	КонецЕсли;  

КонецПроцедуры  

//DEV-12001 baklanov 03.12.2024
Процедура ЗаполнитьТаблицуСоединенийНаСервере(СтрокаПлатформа,Сервер,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	    	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
		
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " connection list --cluster=" + ИдентификаторКластера; 
		мКолонкиТЗ = "connection,connId,host,process,infobase,application,connectedAt,sessionNumber,blockedByLs";
		ПериодЗаписи = ТекущаяДата(); 
		ТаблицаСеансов = ПолучитьТаблицуНаСервере(ТекущаяКоманда,мКолонкиТЗ,КодировкаЗаписи,КодировкаЧтения);
		Кластер = СтрШаблон("%1:%2",Сервер,мНомерПорта);
		РегистрыСведений.ксСоединения.ЗаписатьСоединения(ТаблицаСеансов, Кластер, ПериодЗаписи);	
	КонецЕсли;  

КонецПроцедуры  

// DEV-12001 ponomarev 27.01.2025
Функция ПолучитьТаблицуИнформационныхБазНаСервере(СтрокаПлатформа,Сервер,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
		
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " infobase summary list --cluster=" + ИдентификаторКластера; 
		мКолонкиТЗ = "infobase,name,descr";
		Таблица = ПолучитьТаблицуНаСервере(ТекущаяКоманда,мКолонкиТЗ,КодировкаЗаписи,КодировкаЧтения);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

//DEV-12001 baklanov 03.12.2024
Процедура ЗаполнитьТаблицуИнформационныхБазНаСервере(СтрокаПлатформа,Сервер,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	    	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
		
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " infobase summary list --cluster=" + ИдентификаторКластера; 
		мКолонкиТЗ = "infobase,name,descr";
		ТаблицаСеансов = ПолучитьТаблицуНаСервере(ТекущаяКоманда,мКолонкиТЗ,КодировкаЗаписи,КодировкаЧтения);
		Кластер = СтрШаблон("%1:%2",Сервер,мНомерПорта);
		РегистрыСведений.ксИнформационныеБазы.ЗаписатьИнформационныеБазы(ТаблицаСеансов, Кластер);	
	КонецЕсли;  

КонецПроцедуры  

//DEV-12001 baklanov 03.12.2024
Процедура ЗаполнитьТаблицуПроцессовНаСервере(СтрокаПлатформа,Сервер,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	    	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
		
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " process list --cluster=" + ИдентификаторКластера; 
		мКолонкиТЗ = "process,host,port,pid,isEnable,running,startedAt,use,availablePerfomance,capacity,connections,memorySize,memoryExcessTime,selectionSize,avgCallTime,avgDbCallTime,avgLockCallTime,avgServerCallTime,avgThreads,reserve";
		ПериодЗаписи = ТекущаяДата(); 
		ТаблицаСеансов = ПолучитьТаблицуНаСервере(ТекущаяКоманда,мКолонкиТЗ,КодировкаЗаписи,КодировкаЧтения);
		Кластер = СтрШаблон("%1:%2",Сервер,мНомерПорта);
		РегистрыСведений.ксПроцессы.ЗаписатьПроцессы(ТаблицаСеансов, Кластер, ПериодЗаписи);	
	КонецЕсли;  

КонецПроцедуры 

//DEV-12001 baklanov 04.12.2024
Процедура ЗаполнитьТаблицуКластеровНаСервере(СтрокаПлатформа,Сервер,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;

	мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
	СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
	СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
	
	ТекущаяКоманда = СтрокаПлатформа + СерверПорт +" cluster list"; 
	мКолонкиТЗ = "cluster,host,port,name,expirationTimeout,lifetimeLimit,maxMemorySize,maxMemoryTimeLimit,securityLevel,sessionFaultToleranceLevel,loadBalancingMode,errorsCountThreshold,killProblemProcesses,killByMemoryWithDump";
	ТаблицаСеансов = ПолучитьТаблицуНаСервере(ТекущаяКоманда,мКолонкиТЗ,КодировкаЗаписи,КодировкаЧтения);
	Кластер = СтрШаблон("%1:%2",Сервер,мНомерПорта);
	РегистрыСведений.ксКластеры.ЗаписатьКластер(ТаблицаСеансов, Кластер);	
 

КонецПроцедуры 

//DEV-12001 baklanov 04.12.2024
Процедура ЗавершитьСеансНаСервере(СтрокаПлатформа,Сервер,НомерПорта,ИдентификаторКластера,ИдентификаторСессии,СписокРезультат = "", КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;

	мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
	СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
	СерверПорт = СтрЗаменить(СерверПорт,"localhost",Сервер);
	//Текст = "%ПутьКИсполняемомуФайлуRAC% session %server%:%port_ras% --cluster=%cluster% --cluster-user=%cluster_user% --cluster-pwd=%cluster_pwd% terminate --session=%session% out->%ИмяВременногоФайла%";
	ТекущаяКоманда = СтрокаПлатформа + " session "+ СерверПорт +" --cluster=" + ИдентификаторКластера + " terminate --session=" + ИдентификаторСессии; 
	СписокРезультат = ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи, КодировкаЧтения);
	//Кластер = СтрШаблон("%1:%2",Сервер,мНомерПорта);
	//РегистрыСведений.ксКластеры.ЗаписатьКластер(ТаблицаСеансов, Кластер);	
 

КонецПроцедуры




//DEV-12001 baklanov 03.12.2024
Функция ПолучитьТаблицуНаСервере(ТекущаяКоманда="",КолонкиТЗ="",КодировкаЗаписи="cp866",КодировкаЧтения="cp866") 
	
	ТаблицаРезультат = Новый ТаблицаЗначений;    
	
	
	Если ТекущаяКоманда <> "" И КолонкиТЗ <> "" Тогда		
		СписокРезультат = ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи, КодировкаЧтения);
		МассивИнформации = СтрРазделить(СписокРезультат, Символы.ПС);
		ТаблицаРезультат = Новый ТаблицаЗначений;
		Для Каждого ТекЭлемента из СтрРазделить(КолонкиТЗ,",") Цикл
			ТаблицаРезультат.Колонки.Добавить(ТекЭлемента);
		КонецЦикла;	
		НоваяСтрока = ТаблицаРезультат.Добавить();
		Для Каждого ЭлементТекст Из МассивИнформации Цикл
			МассивКолонки = СтрРазделить(ЭлементТекст, ":", Истина);
			Если МассивКолонки.Количество() > 1 Тогда
				ИмяКолонки = СокрЛП(СтрЗаменить(МассивКолонки[0], "-", ""));
				////<< TODO Danilin.V 26 января 2026 г. 15:07:00   
				Если ТаблицаРезультат.Колонки.Найти(ИмяКолонки)=Неопределено Тогда
					ТаблицаРезультат.Колонки.Добавить(ИмяКолонки);	
				КонецЕсли;
				НоваяСтрока[ИмяКолонки] = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
				ЭтоПустаяСтрока = Ложь;
			Иначе
				НоваяСтрока = ТаблицаРезультат.Добавить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Возврат ТаблицаРезультат;

КонецФункции 


//DEV-12001 baklanov 05.12.2024
Функция ПолучитьЖурналРегистрации(ssesion, rows, datastart) Экспорт
	ИмяСервера = "vmweb1c01";
	ИмяПользователя = "apiquery";
	Пароль = "m322341tt0zpvs43l4d5";

	мЗапрос = "/wserpwork/hs/query/query_data/{""id_api_query"": ""readeventlog"",""param"": {""session"": """+ssesion+""",""rows"": """+rows+""",""datastart"": """+datastart+"""}}";
	
	HTTP = Новый HTTPСоединение(ИмяСервера, 80, ИмяПользователя, Пароль);		
	запросPOST = Новый HTTPЗапрос(мЗапрос);
	HTTPОтвет = HTTP.Получить(запросPOST); //отправляем
	
	мЗначение = Неопределено;
	Если НЕ HTTPОтвет.КодСостояния = 200 Тогда				
		ТекстСообщения = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"); 
		Сообщить("err: " + HTTPОтвет.КодСостояния);		 
	Иначе                                           		
		ТекстСообщения = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"); 
		мЗначение = ДесереализацияJSON(ТекстСообщения);
	КонецЕсли;		
	Возврат мЗначение;	
КонецФункции 

//DEV-12001 baklanov 05.12.2024
Функция ДесереализацияJSON(Строка_json) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Строка_json); 
	ДанныеЗагрузки = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат ДанныеЗагрузки;	
КонецФункции

//
Процедура УдалитьУстаревшиеДанные() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлубинаХранения.ЗнчМетаданные КАК ЗнчМетаданные,
		|	ГлубинаХранения.РеквизитПоиска КАК РеквизитПоиска,
		|	ГлубинаХранения.СрокХраненияДней КАК СрокХраненияДней
		|ИЗ
		|	РегистрСведений.ГлубинаХранения КАК ГлубинаХранения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗнчМетаданные = ВыборкаДетальныеЗаписи.ЗнчМетаданные;
		РеквизитПоиска = ВыборкаДетальныеЗаписи.РеквизитПоиска;
		СрокХраненияДней = ВыборкаДетальныеЗаписи.СрокХраненияДней; 
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ЗнчМетаданные); 
		Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
			УдалитьУстаревшиеДанныеПоОтбору(ЗнчМетаданные, РеквизитПоиска, СрокХраненияДней, ОбъектМетаданных)	
		Иначе
			УдалитьУстаревшиеДанныеПоСсылкам(ЗнчМетаданные, РеквизитПоиска, СрокХраненияДней)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры   

Процедура УдалитьУстаревшиеДанныеПоОтбору(ЗнчМетаданные, РеквизитПоиска, СрокХраненияДней, ОбъектМетаданных)
	ПоДату = НачалоДня(ТекущаяДата())- 86400 * СрокХраненияДней; 
	МИзмерения = Новый Массив;
	Если ОбъектМетаданных.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		Для Каждого Изм Из ОбъектМетаданных.Измерения Цикл
			МИзмерения.Добавить(Изм.Имя);	
		КонецЦикла;
	Иначе
		МИзмерения.Добавить("Период");
		Для Каждого Изм Из ОбъектМетаданных.Измерения Цикл
			МИзмерения.Добавить(Изм.Имя);	
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	СтрИзмерения = "";
	Для Каждого Эл Из МИзмерения Цикл 
		Если СтрИзмерения = "" Тогда
			СтрИзмерения = Эл;
		Иначе
			СтрИзмерения = СтрИзмерения + ", " + Эл; 
		КонецЕсли;
	КонецЦикла;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&СтрИзмерения
		|ИЗ
		|	&Метаданные КАК Т
		|ГДЕ
		|	&РеквизитПоиска <= &ПоДату"; 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Метаданные", ЗнчМетаданные);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитПоиска", РеквизитПоиска);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрИзмерения", СтрИзмерения);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПоДату", ПоДату);
	ЗапросРез = Запрос.Выполнить();
	ЗапросВыб = ЗапросРез.Выбрать();
	Пока ЗапросВыб.Следующий() Цикл
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ЗнчМетаданные);
		НаборЗаписей = Менеджер.СоздатьНаборЗаписей(); 
		Для Каждого Эл Из МИзмерения Цикл
			ЗначОтбора = ЗапросВыб[Эл];
			ЭлОтбора = НаборЗаписей.Отбор[Эл];
			ЭлОтбора.Установить(ЗначОтбора);
		КонецЦикла;  
		НаборЗаписей.Записать();
	КонецЦикла;

	//ТаблицаОставляемыхЗаписей  = Запрос.Выполнить().Выгрузить(); 
	//Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ЗнчМетаданные);
	//
	//НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
	//НаборЗаписей.Загрузить(ТаблицаОставляемыхЗаписей);
	//НаборЗаписей.Записать();   

	
КонецПроцедуры

Процедура УдалитьУстаревшиеДанныеПоСсылкам(ЗнчМетаданные, РеквизитПоиска, СрокХраненияДней)
	ПоДату = НачалоДня(ТекущаяДата())- 86400 * СрокХраненияДней;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	&Метаданные КАК Т
		|ГДЕ
		|	&РеквизитПоиска <= &ПоДату"; 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Метаданные", ЗнчМетаданные);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитПоиска", РеквизитПоиска); 
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПоДату", ПоДату);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			СсылкаНаОбъект = ВыборкаДетальныеЗаписи.Ссылка;
			УдаляемыйОбъект = СсылкаНаОбъект.ПолучитьОбъект();
			УдаляемыйОбъект.Удалить(); 
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
